Revit 2026 API

# PulldownButton Class

---

The PulldownButton object represents a button with a drop-down list on RibbonPanel.

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIRibbonButton Autodesk.Revit.UIPulldownButton Autodesk.Revit.UISplitButton

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PulldownButton : RibbonButton
```
```vb
Public Class PulldownButton
	Inherits RibbonButton
```
```cpp
public ref class PulldownButton : public RibbonButton
```
```fsharp
type PulldownButton =
    class
        inherit RibbonButton
    end
```

The PulldownButton type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Enabled | Gets or sets a value indicating whether the item is enabled. (Inherited from RibbonItem) |
|  | Image | The image of the button.(Inherited from RibbonButton) |
|  | IsEnabledByContext | Indicates if this button can be executed. True if the pushbutton is permitted to be executed based on the current Revit context (active document, active view and active tool). False if the pushbutton is disabled because of the active context.(Inherited from RibbonButton) |
|  | ItemText | Gets or sets the text displayed on the item. (Inherited from RibbonItem) |
|  | ItemType | Gets the item type.(Inherited from RibbonItem) |
|  | LargeImage | The large image shown on the button.(Inherited from RibbonButton) |
|  | LongDescription | Long description of the command tooltip (Inherited from RibbonItem) |
|  | Name | The name of the item.(Inherited from RibbonItem) |
|  | ToolTip | The description that appears as a ToolTip for the item.(Inherited from RibbonItem) |
|  | ToolTipImage | The image to show as a part of the button extended tooltip (Inherited from RibbonItem) |
|  | Visible | Gets or sets a value indicating whether the item is visible. (Inherited from RibbonItem) |

|  | Name | Description |
| --- | --- | --- |
|  | AddPushButton | Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand. |
|  | AddSeparator | Adds a separator to the drop-down list. |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from RibbonItem) |
|  | GetContextualHelp | Gets the contextual help bound with this control.(Inherited from RibbonItem) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetItems | Gets a copy of the collection of buttons assigned to the pulldown button. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetContextualHelp | Sets the contextual help bound with this button.(Inherited from RibbonItem) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Use of this class is not supported in Revit Macros.

#### Reference

Autodesk.Revit.UI Namespace